Documents/Накладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Накладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОтпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыРазгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказчикАвтомобильнойПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переадресовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СПриложением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияПоЦенообразованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЕздок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускРазрешил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускПроизвел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварКПеревозкеПринял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьВыдал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПервогоПоставщика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОптоваяНадбавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТары</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыпускаПартии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Накладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	Водила = ПолучитьВодителяАвтомобиля(Объект.Автомобиль);
	Объект.ТоварКПеревозкеПринял = "Водитель " + Водила;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчетСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ПересчетСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПервогоПоставщикаПриИзменении(Элемент)
	ПересчетСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОптоваяНадбавкаПриИзменении(Элемент)
	ПересчетСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДатаПартииПриИзменении(Элемент)
	ПересчетСтроки(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПечатьНакладнойНаСервере(ТабДок, Ссылка, ТипНакладной, Приложение)
	
	Если ТипНакладной = "ТН" Тогда 
		Макет =  Документы.Накладная.ПолучитьМакет("ТН");
	ИначеЕсли ТипНакладной = "ТТНВертикальная" Тогда 
		Макет =  Документы.Накладная.ПолучитьМакет("ТТНВертикальная");
	ИначеЕсли ТипНакладной = "ТТНГоризонтальная" Тогда 
		Макет =  Документы.Накладная.ПолучитьМакет("ТТНГоризонтальная");
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Накладная.Ссылка КАК Ссылка,
	|	Накладная.Номер КАК Номер,
	|	Накладная.Дата КАК Дата,
	|	Накладная.Получатель КАК Получатель,
	|	Накладная.ЗаказчикАвтомобильнойПеревозки КАК ЗаказчикАвтомобильнойПеревозки,
	|	Накладная.ОснованиеОтпуска КАК ОснованиеОтпуска,
	|	Накладная.Переадресовка КАК Переадресовка,
	|	Накладная.Автомобиль КАК Автомобиль,
	|	Накладная.ПунктРазгрузки КАК ПунктРазгрузки,
	|	Накладная.Примечание КАК Примечание,
	|	Накладная.ПунктПогрузки КАК ПунктПогрузки,
	|	Накладная.КоличествоЕздок КАК КоличествоЕздок,
	|	Накладная.ПутевойЛист КАК ПутевойЛист,
	|	Накладная.ОтпускРазрешил КАК ОтпускРазрешил,
	|	Накладная.ОтпускПроизвел КАК ОтпускПроизвел,
	|	Накладная.ТоварКПеревозкеПринял КАК ТоварКПеревозкеПринял,
	|	Накладная.ДоверенностьВыдал КАК ДоверенностьВыдал,
	|	Накладная.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		ЦенаПервогоПоставщика КАК ЦенаПервогоПоставщика,
	|		ОптоваяНадбавка КАК ОптоваяНадбавка,
	|		УчетнаяЦена КАК УчетнаяЦена,
	|		Цена КАК Цена,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		НДС КАК НДС,
	|		Всего КАК Всего,
	|		ВидТары КАК ВидТары,
	|		Мест КАК Мест,
	|		Вес КАК Вес,
	|		ДатаГодности КАК ДатаГодности,
	|		НомерПартии КАК НомерПартии,
	|		ДатаВыпускаПартии КАК ДатаВыпускаПартии
	|	) КАК Товары,
	|	Накладная.Представление КАК Представление,
	|	Накладная.МоментВремени КАК МоментВремени,
	|	Накладная.ДоверенностьНомер КАК ДоверенностьНомер,
	|	Накладная.ДоверенностьДата КАК ДоверенностьДата
	|ИЗ
	|	Документ.Накладная КАК Накладная
	|ГДЕ
	|	Накладная.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВДЗ = РезультатЗапроса.Выбрать();
	
	ОбластьУНП = Макет.ПолучитьОбласть("УНП");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаб");
	ОбластьСтрокаПри = Макет.ПолучитьОбласть("СтрПри");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаб");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Если ТипНакладной <> "ТН" Тогда
		ОбластьТаблицаТранспорта = Макет.ПолучитьОбласть("Шапка1");
	КонецЕсли;
	ОбластьШапкаПриложения = Макет.ПолучитьОбласть("ШапкаПри");
	ОбластьСтрокаПриложения = Макет.ПолучитьОбласть("СтрокаНП");
	ОбластьДокументы = Макет.ПолучитьОбласть("Док");
	
	
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	
	
	Пока ВДЗ.Следующий() Цикл
		ОбластьУНП.Параметры.НашУНП = Константы.УНП.Получить();
		ОбластьУНП.Параметры.ПолучательУНП = ВДЗ.Получатель.УНП;
		Если ТипНакладной <> "ТН" Тогда
			ОбластьУНП.Параметры.ЗаказчикУНП = ВДЗ.ЗаказчикАвтомобильнойПеревозки.УНП;
		КонецЕсли;
		ТабДок.Вывести(ОбластьУНП); 
		
		ОбластьШапка.Параметры.ДатаДок = Формат(ВДЗ.Дата, "ДЛФ=DD");
		
		Если ТипНакладной <> "ТН" Тогда
			ОбластьШапка.Параметры.Автомобиль = ВДЗ.Автомобиль.Наименование +" "+ ВДЗ.Автомобиль.ГосЗнак;
			Если ВДЗ.Автомобиль.Прицеп Тогда
				ОбластьШапка.Параметры.Прицеп = ВДЗ.Автомобиль.МаркаПрицепа +" "+ ВДЗ.Автомобиль.ГосЗнакПрицепа;
			Иначе 
				ОбластьШапка.Параметры.Прицеп = "";
			КонецЕсли;
			ОбластьШапка.Параметры.ПутевойЛист = ВДЗ.ПутевойЛист;
			ОбластьШапка.Параметры.Водитель = ВДЗ.Автомобиль.Водитель;
			ОбластьШапка.Параметры.Переадресовка = ВДЗ.Переадресовка;
			ОбластьШапка.Параметры.ПунктПогрузки = ВДЗ.ПунктПогрузки;
			ОбластьШапка.Параметры.ПунктРазгрузки = ВДЗ.ПунктРазгрузки;
			ОбластьШапка.Параметры.ЗаказчикПлательщик = ВДЗ.ЗаказчикАвтомобильнойПеревозки.Наименование+" "+ВДЗ.ЗаказчикАвтомобильнойПеревозки.ЮридическийАдрес;
		КонецЕсли;
		ОбластьШапка.Параметры.Грузоотправитель = ОбщегоНазначенияСервер.ПолучитьНаименованиеОрганизации() +" "+Константы.ЮридическийАдрес.Получить();
		ОбластьШапка.Параметры.Грузополучатель = ВДЗ.Получатель.Наименование+" "+ВДЗ.Получатель.ЮридическийАдрес;
		ТабДок.Вывести(ОбластьШапка);
		
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		Если Приложение Тогда
			// Тут надо что-то дописать для выводов количества страниц Приложения
			ТабДок.Вывести(ОбластьСтрокаПри);
		КонецЕсли;
		Если Не Приложение Тогда
			ИтогоКол = 0; ИтогСумма = 0; ВсегоНДС = 0; ВсегоСуммаСНДС = 0; КолМест = 0; ИтогМасса = 0;
			ВыборкаНоменклатура = ВДЗ.Товары.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаНоменклатура);
				ОбластьСтрока.Параметры.ТМЦ = ВыборкаНоменклатура.Номенклатура;
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = ВыборкаНоменклатура.Номенклатура.ЕдиницыИзмерения;
				ОбластьСтрока.Параметры.Количество = ВыборкаНоменклатура.Количество;
				ИтогоКол = ИтогоКол + ВыборкаНоменклатура.Количество;
				ОбластьСтрока.Параметры.Цена1 = ВыборкаНоменклатура.Цена;
				ОбластьСтрока.Параметры.Сумма = ВыборкаНоменклатура.Сумма;
				ИтогСумма = ИтогСумма + ВыборкаНоменклатура.Сумма;
				ОбластьСтрока.Параметры.СтрНДС = ВыборкаНоменклатура.СтавкаНДС;
				ОбластьСтрока.Параметры.НДС = ВыборкаНоменклатура.НДС;
				ВсегоНДС = ВсегоНДС + ВыборкаНоменклатура.НДС;
				ОбластьСтрока.Параметры.СуммаСНДС = ВыборкаНоменклатура.Всего;
				ВсегоСуммаСНДС = ВсегоСуммаСНДС + ВыборкаНоменклатура.Всего;
				Если ТипНакладной <> "ТН" Тогда
					ОбластьСтрока.Параметры.КолГрузМест = ВыборкаНоменклатура.Мест;
					КолМест = КолМест + ВыборкаНоменклатура.Мест;
					ОбластьСтрока.Параметры.Масса = ВыборкаНоменклатура.Вес;
					ИтогМасса = ИтогМасса + ВыборкаНоменклатура.Вес;
				КонецЕсли;
				ТабДок.Вывести(ОбластьСтрока);
			КонецЦикла;
		КонецЕсли;
		
		
		ОбластьПодвалТаблицы.Параметры.ИтогоКол = ИтогоКол;
		ОбластьПодвалТаблицы.Параметры.ИтогСумма = ИтогСумма;
		ОбластьПодвалТаблицы.Параметры.ВсегоНДС = ВсегоНДС;
		ОбластьПодвалТаблицы.Параметры.ВсегоСуммаСНДС = ВсегоСуммаСНДС;
		ОбластьПодвалТаблицы.Параметры.Примечание = ВДЗ.Примечание;
		Если ТипНакладной <> "ТН" Тогда
			ОбластьПодвалТаблицы.Параметры.КоличествоЕздок = ВДЗ.КоличествоЕздок;
			ОбластьПодвалТаблицы.Параметры.КолМест = КолМест;
			ОбластьПодвалТаблицы.Параметры.ИтогМасса = ИтогМасса;
		КонецЕсли;
		ТабДок.Вывести(ОбластьПодвалТаблицы);
		
		
		ОбластьПодвал.Параметры.ВсегоНДСПропись = ЧислоПрописью(ВсегоНДС,, "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ОбластьПодвал.Параметры.ВсегоСуммаСНДСПропись = ЧислоПрописью(ВсегоСуммаСНДС,, "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		Если ТипНакладной <> "ТН" Тогда 
			ОбластьПодвал.Параметры.БруттоПрописью = ЧислоПрописью(ИтогМасса, "ДП = Истина", НСтр("ru='тонна, тонны, тонн, ж, кг., кг., кг., м,3'"));
			ОбластьПодвал.Параметры.КолМестПропись = ЧислоПрописью(КолМест,," , , , , , , , , 0");
		КонецЕсли;
		ОбластьПодвал.Параметры.ОтпускРазрешил = ВДЗ.ОтпускРазрешил.Должность.Наименование +" "+ ВДЗ.ОтпускРазрешил.Наименование;
		ОбластьПодвал.Параметры.ОтпускПроизвел = ВДЗ.ОтпускПроизвел.Должность.Наименование +" "+ ВДЗ.ОтпускПроизвел.Наименование;
		ОбластьПодвал.Параметры.КомуВыданы = ВДЗ.ТоварКПеревозкеПринял;
		ОбластьПодвал.Параметры.Доверенность = "№"+СокрЛП(ВДЗ.ДоверенностьНомер)+" от "+ Формат(ВДЗ.ДоверенностьДата, "ДЛФ=ДД");
		ОбластьПодвал.Параметры.пВыданной = СокрЛП(ВДЗ.ДоверенностьВыдал);
		
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТН(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНакладнойНаСервере(ТабДок, Объект.Ссылка, "ТН", Объект.СПриложением);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();	
КонецПроцедуры

&НаКлиенте
Процедура ТТНВертикальная(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНакладнойНаСервере(ТабДок, Объект.Ссылка, "ТТНВертикальная", Объект.СПриложением);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();	
КонецПроцедуры

&НаКлиенте
Процедура ТТНГоризонтальная(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНакладнойНаСервере(ТабДок, Объект.Ссылка, "ТТНГоризонтальная", Объект.СПриложением);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПересчетСтроки(ТекСтр)
	ТекСтр.Цена = ТекСтр.ЦенаПервогоПоставщика*(1+(ТекСтр.ОптоваяНадбавка/100));
	ТекСтр.Сумма = ТекСтр.Цена*ТекСтр.Количество;
	Если Не ПустаяСтрока(ТекСтр.СтавкаНДС) Тогда
		ТекСтр.НДС = ТекСтр.Сумма*(ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС)/100);
	Иначе 
		ТекСтр.НДС = 0;
	КонецЕсли;
	Если ПолучитьКГМ(ТекСтр.Номенклатура) <> 0 Тогда
		ТекСтр.Мест = ТекСтр.Количество/ПолучитьКГМ(ТекСтр.Номенклатура);
	КонецЕсли;
	ТекСтр.Вес = ТекСтр.Количество*ПолучитьВесЕдиницы(ТекСтр.Номенклатура);
	ТекСтр.Всего = ТекСтр.Сумма + ТекСтр.НДС;
	Если Не ПустаяСтрока(ТекСтр.ДатаВыпускаПартии) Тогда
		ТекСтр.ДатаГодности = ДобавитьМесяц(ТекСтр.ДатаВыпускаПартии, ПолучитьСрокГодности(ТекСтр.Номенклатура));
	КонецЕсли
КонецФункции

&НаСервере
Функция ПолучитьВодителяАвтомобиля(Автомобиль)
	Водила = Автомобиль.ПолучитьОбъект().Водитель;
	Возврат Водила;
КонецФункции

&НаСервере
Функция ПолучитьКГМ(Номенклатура)
	Номенклатура.ПолучитьОбъект();
	Возврат Номенклатура.КоличествоВОдномГрузовомМесте;
КонецФункции

&НаСервере
Функция ПолучитьВесЕдиницы(Номенклатура)
	Номенклатура.ПолучитьОбъект();
	Возврат Номенклатура.ВесЕдиницы;
КонецФункции

&НаСервере
Функция ПолучитьСтавкуНДС(СтавкаНДС)
	СтавкаНДС.ПолучитьОбъект();
	Возврат СтавкаНДС.Значение;
КонецФункции

&НаСервере
Функция ПолучитьСрокГодности(Номенклатура)
	Номенклатура.ПолучитьОбъект();
	Возврат Номенклатура.СрокГодности;
КонецФункции

#КонецОбласти
